erpdev.СХК_Расширение/src/DataProcessors/СХК_МобильныйСкладСырье/СХК_МобильныйСкладСырье.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>СХК_МобильныйСкладСырье</name>
  <attributes>
    <name>Склад</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокГодности</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТабПриемка</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>ШтихКод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоСобрано</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

erpdev.СХК_Расширение/src/Catalogs/СерииНоменклатуры/СерииНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>СерииНоменклатуры</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>ГоденДо</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаПроизводства</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="cb25b6bc-7f7a-447b-8658-e8893ac87128">
    <name>ВидНоменклатуры</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СХК_Упаковка</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="43c7d80b-bd8e-4151-b0e1-084444292845">
    <name>Номер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СХК_СрокГодности</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СХК_Префикс</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="448beea5-fe0e-4558-b386-88fdde891a35">
    <name>ПроизводительВЕТИС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="811ed59d-1e61-4b9f-b4fb-3b5dc1e65b8c">
    <name>RFIDUser</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="dbf11029-162c-49c8-b54b-767bda8ca180">
    <name>СерияНоменклатурыДляЦенообразования</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="80a89a7f-1fed-4811-b40c-3a5ab50662a9">
    <name>RFIDTID</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e0c1efe6-bb2e-4ed3-80a8-cab3c7e1b456">
    <name>RFIDEPC</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6dd6eb6e-b1b8-4da9-9b97-35f41594d1d6">
    <name>EPCGTIN</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="50ccfd5f-e7cd-4e00-a6ee-2b31c3198df5">
    <name>RFIDМеткаНеЧитаемая</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="28ebda52-1b95-4474-a953-08ea8d771161">
    <name>НомерКиЗГИСМ</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b41bc339-8059-4e1b-a18e-9b2d19e4c2e1">
    <name>ПроизводительЕГАИС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0031dd3e-8675-47e2-ae98-c7e7a9b2060a">
    <name>ИдентификаторПартииВЕТИС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f266e93e-196b-4c32-867c-1eb7dcc148b4">
    <name>Справка2ЕГАИС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="888c0446-d41f-43e2-9d71-c2abeb77ef11">
    <name>ЗаписьСкладскогоЖурналаВЕТИС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ff2d5643-26e8-40ec-b266-8fb17cd78983">
    <name>МаксимальнаяРозничнаяЦенаМОТП</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
</mdclass:Catalog>

erpdev.СХК_Расширение/src/DataProcessors/СХК_МобильныйСкладСырье/Forms/ФормаСерии/Module.bsl
&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	СтуктураВозврат = Новый Структура;
	СтуктураВозврат.Вставить("Номер",ЭтаФорма.СерииНоменклатуры);
	ОповеститьОВыборе(СтуктураВозврат); 
КонецПроцедуры

&НаСервере
Функция СохранитьНаСервере() 
	
	Если Строка(ЭтотОбъект.Номенклатура.ВидНоменклатуры.Ссылка.УникальныйИдентификатор()) = "cd5f0400-37d5-11e8-ab89-001e67f91767" ИЛИ  Строка(ЭтотОбъект.Номенклатура.ВидНоменклатуры.Ссылка.УникальныйИдентификатор()) = "82c0513e-e661-11e8-e599-001e67f91767" Тогда 
    	ГоденДо = Дата(1,1,1);
	Иначе
		Если ЭтотОбъект.Календарь = Дата(1,1,1) ИЛИ ДобавитьМесяц(ЭтотОбъект.Календарь,ЭтотОбъект.Номенклатура.СрокГодности) <= ТекущаяДата() Тогда
			ош =  Ложь;  
			Возврат ош;  
		Иначе
	    	ГоденДо = ДобавитьМесяц(ЭтотОбъект.Календарь,ЭтотОбъект.Номенклатура.СрокГодности);
		КонецЕсли;		
	КонецЕсли;		
	
	
	СерияНоменклатуры = ПолучитьСериюПоНомеру(Строка(ЭтаФорма.НомерВходящегоДокумента) +" "+ Строка(ЭтаФорма.Упаковка.Наименование),ЭтотОбъект.Номенклатура,ЭтотОбъект.Календарь);
	
	Если СерияНоменклатуры.Пустая() = Истина Тогда 
		спр = Справочники.СерииНоменклатуры.СоздатьЭлемент();
	Иначе
		спр = СерияНоменклатуры.ПолучитьОбъект();
	КонецЕсли;   
	
	спр.ДатаПроизводства = ЭтотОбъект.Календарь;
	спр.ГоденДо = ГоденДо;
	спр.ВидНоменклатуры = ЭтотОбъект.Номенклатура.ВидНоменклатуры; 
	спр.СХК_Упаковка = ЭтотОбъект.Упаковка;
	Если ЭтаФорма.Упаковка.Числитель = 1 Тогда
		спр.Наименование =  ЭтаФорма.НомерВходящегоДокумента;
		спр.Номер =  ЭтаФорма.НомерВходящегоДокумента;   
	Иначе
		спр.Наименование =  Строка(ЭтаФорма.НомерВходящегоДокумента) +" "+ Строка(ЭтаФорма.Упаковка.Наименование);
		спр.Номер =  Строка(ЭтаФорма.НомерВходящегоДокумента) +" "+ Строка(ЭтаФорма.Упаковка.Наименование);   
	КонецЕсли;		
	
	Попытка
		спр.Записать(); 
		ЭтаФорма.СерииНоменклатуры = спр.Ссылка;
		ош =  Истина;
	Исключение
		ош =  Ложь;
	КонецПопытки; 
	
	Возврат ош;
		
КонецФункции

 &НаСервере
 Функция  ПолучитьСериюПоНомеру(Номер,Номенклатура,ДатаПроизводства) 
	 
	СсылкаСерия = Справочники.СерииНоменклатуры.ПустаяСсылка();
	 
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	СерииНоменклатуры.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.СерииНоменклатуры КАК СерииНоменклатуры
	               |ГДЕ
	               |	СерииНоменклатуры.Номер = &Номер
	               |	И СерииНоменклатуры.ВидНоменклатуры = &ВидНоменклатуры
	               |	И СерииНоменклатуры.ДатаПроизводства = &ДатаПроизводства" ;
	Запрос.УстановитьПараметр("Номер",Номер);
	Запрос.УстановитьПараметр("ВидНоменклатуры",Номенклатура.ВидНоменклатуры);
	Запрос.УстановитьПараметр("ДатаПроизводства",ЭтотОбъект.Календарь);
	Рез = Запрос.Выполнить().Выбрать();
	Если Рез.Следующий() Тогда 
		СсылкаСерия =  Рез.Ссылка;
	КонецЕсли;
	
 	Возврат  СсылкаСерия;
	
КонецФункции


&НаКлиенте
Процедура Сохранить(Команда)
	Если СохранитьНаСервере() Тогда
		ЭтаФорма.Закрыть();
	Иначе
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияПредупреждениеСохранения", ЭтотОбъект);	
		ПоказатьПредупреждение(Оповещение,"Заполните корректно дату срока годности",5,"Внимание!!!");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияПредупреждениеСохранения(Значение) Экспорт
		
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	СтруктураПараметров = ПолучитьИзВременногоХранилища(Параметры.Адрес);
	Если СтруктураПараметров.НомерВходящегоДокумента <> "" Тогда
		ЭтотОбъект.НомерВходящегоДокумента = СтруктураПараметров.НомерВходящегоДокумента;//УправлениеКонтактнойИнформациейКлиентСервер.ОставитьТолькоЦифрыВСтроке(СтруктураПараметров.НомерВходящегоДокумента.Номер);
    	ЭтотОбъект.Номенклатура = СтруктураПараметров.Номенклатура;	
    	ЭтотОбъект.СерииНоменклатуры = СтруктураПараметров.СерииНоменклатуры;
    	ЭтотОбъект.Упаковка = СтруктураПараметров.Упаковка;
		ЭтотОбъект.Календарь = ТекущаяДата();
	Иначе
		Отказ = Истина;
	КонецЕсли;

КонецПроцедуры
